import Link from 'next/link';
import GobackBtn from './GobackBtn';

export default function GoodsHeader() {
  return (
    <header className=" mx-auto w-full bg-white">
      <div className="mx-auto flex h-12 items-center justify-between px-[18px]">
        {/* 뒤로가기 */}
        {/* TODO: 혹은 router.back() 받기 */}
        <GobackBtn link="/" />

        {/* 맨 우측 버튼들 */}
        <div className="flex gap-4">
          {/* 홈 */}
          <Link href="/">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
            >
              <path
                d="M21 20.0001C21 20.2653 20.8946 20.5196 20.7071 20.7072C20.5196 20.8947 20.2652 21.0001 20 21.0001H4C3.73478 21.0001 3.48043 20.8947 3.29289 20.7072C3.10536 20.5196 3 20.2653 3 20.0001V9.49005C2.99989 9.33766 3.03462 9.18727 3.10152 9.05035C3.16841 8.91343 3.26572 8.79362 3.386 8.70005L11.386 2.47705C11.5615 2.3405 11.7776 2.26636 12 2.26636C12.2224 2.26636 12.4385 2.3405 12.614 2.47705L20.614 8.70005C20.7343 8.79362 20.8316 8.91343 20.8985 9.05035C20.9654 9.18727 21.0001 9.33766 21 9.49005V20.0001ZM19 19.0001V9.97805L12 4.53405L5 9.97805V19.0001H19ZM7 15.0001H17V17.0001H7V15.0001Z"
                fill="#1A1A1A"
              />
            </svg>
          </Link>

          {/* 돋보기 버튼 */}
          <button>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
            >
              <path
                d="M18.031 16.617L22.314 20.899L20.899 22.314L16.617 18.031C15.0237 19.3082 13.042 20.0029 11 20C6.032 20 2 15.968 2 11C2 6.032 6.032 2 11 2C15.968 2 20 6.032 20 11C20.0029 13.042 19.3082 15.0237 18.031 16.617ZM16.025 15.875C17.2938 14.5697 18.0025 12.8204 18 11C18 7.133 14.867 4 11 4C7.133 4 4 7.133 4 11C4 14.867 7.133 18 11 18C12.8204 18.0025 14.5697 17.2938 15.875 16.025L16.025 15.875Z"
                fill="black"
              />
            </svg>
          </button>
        </div>
      </div>
    </header>
  );
}
